app/controllers/posts_controller.rb

  def create
  	@post = Post.new title: params[:title],
  					 content: params[:content]
  	if @post.save
---
INSERT INTO "posts" ("title", "content") VALUES (?, ?)  [["title", "0401"], ["content", "愚人節\r\n"]]